[
    {
      "passioID": "1003658",
      "name": "Adho Mukha Shvanasana",
      "sanskrit": "अधोमुखश्वानासन",
      "english": "Downward-Facing Dog",
      "type": "Standing",
      "description": "The pose has the head down, ultimately touching the floor, with the weight of the body on the palms and the feet. The arms are stretched straight forward, shoulder width apart; the feet are a foot apart, the legs are straight, and the hips are raised as high as possible.\nThe pose is approached differently in different schools of yoga. In Iyengar Yoga, the pose can be entered from a prone position, with the hands beside the chest, setting the distance between hands and feet.In schools such as Sivananda Yoga, the pose is practised as part of Surya Namaskar, the Salute to the Sun, for example following Urdhva Mukha Shvanasana (Upward Dog Pose) by exhaling, curling the toes under, and raising the hips. In the Bihar School of Yoga, the pose is named Parvatasana, Mountain Pose, the hands and feet somewhat closer to each other so that the angle at the hips is sharper; it is entered from a lunge (Ashwa Sanchalanasana) in a variant of Surya Namaskar.",
      "url": "https://en.wikipedia.org/wiki/Downward_Dog_Pose",
      "benefits": "• This posture is known to generate the lost energy due to fatigue or when you are exhausted.\n• Highly recommended for runners and they can perform this posture after getting tired due to hard race and also sprinters or fast runners develop speed and lightness in the legs.\n• Adho mukha svanasana when practiced regularly strengthens legs and ankles and makes them look toned.\n• This asana helps in relieving pain and stiffness in legs.\n• The constant stretch on heels may help to soften the calcaneal spur which gives pain on heels.\n• The effort to touch the crown of your head on the mat eradicates stiffness in shoulder blades.\n• The arthritis in the shoulder joints is relieved.\n• This posture can make you feel exhilarated.\n• Those who have started the practice of asana newly and have fear of inversion like sirshasana can practice this posture to derive the same benefit.\n• This asana rejuvenates the brain cells and stimulates the brain."
    },
    {
      "passioID": "1003661",
      "name": "Adho Mukha Vrikshasana",
      "sanskrit": "अधोमुखवृक्षासन",
      "english": "Downward-Facing Tree",
      "type": "Balancing",
      "description": "Handstands use the wrist flexor muscles as well as the anterior deltoid, pectoralis major, latissimus dorsi, biceps brachii, and trapezius descendens.It is considered demanding in terms of both the muscle and joint requirement.\nAccording to a 2017 study most handbalancers use wrist movement to maintain balance in a handstand.\nAnother study found that handbalancers who were also expert gymnasts had better coordination than those at an intermediate level of gymnastics.More advanced practitioners also altered their center of pressure less to change the center of mass when making corrections to handstand position.\nHandstand moves involving an especially high amount of strength include the press handstand and handstand push-up.",
      "url": "https://en.wikipedia.org/wiki/Handstand",
      "benefits": "• It boosts breathing capacity as it fully expands the chest.\n• It strengthens the hand, arms, wrist, and shoulder muscles.\n• It stretches the abdominal muscles and boosts digestion.\n• It improves the balance and coordination of the body.\n• It improves cardiovascular endurance and activates the baroreceptors in the carotid arteries.\n• It calms the mind and reduces stress levels. It also alleviates the symptoms of depression.\n• Provides relief from headaches and decreases blood pressure in the arteries.\n "
    },
    {
      "passioID": "1003672",
      "name": "Anantasana",
      "sanskrit": "अनन्तासन",
      "english": "Ananta's pose",
      "type": "Reclining",
      "description": "Anantasana is entered from a lying position. The head is supported with one hand, the upper arm on the ground on that side; the other hand and leg are stretched straight up, the fingers grasping the big toe of the raised foot. The supporting arm, body, and lower leg are in a straight line.",
      "url": "https://en.wikipedia.org/wiki/Anantasana",
      "benefits": "• Your muscles on the side of the torso get stretched and strengthened which helps in balancing your body. \n• Anantasana is so easy that you can learn it using this guide or join online yoga classes. \n• The asana improves blood circulation and induces relaxation in your brain."
    },
    {
      "passioID": "1003673",
      "name": "Anjaneyasana",
      "sanskrit": "अञ्जनेयासन",
      "english": "Crescent Moon",
      "type": "Standing",
      "description": "The asana is entered from a lunge, with the back knee lowered to the ground, the back arched and the arms raised and stretched over the head. The toes of the back foot are pointed back in styles such as Ashtanga Vinyasa Yoga and other styles, the top of the foot on the floor, though in other styles such as Sivananda Yoga the toes are tucked under. The front foot remains in standing position, the hips lowered close to the front foot and the front knee fully bent and pointing forwards. In the full asana, the rear foot is lifted and grasped with both hands, the elbows pointing up.",
      "url": "https://en.wikipedia.org/wiki/Anjaneyasana",
      "benefits": "• Stretches the hips on the back leg.\n• Opens the hip flexors and strengthens the hip extensors.\n• Stretches the psoas muscles.\n• Opens the shoulders and chest.\n• Strengthens the quadriceps, gluteus maximus, and hamstrings.\n• Builds strength for the muscles that support the knee.\n• Stretches the front of the ankle and strengthens calf muscles on the back leg.\n• Stretches the calf muscles on the front leg.\n• Engages the deep core muscles, which help create stability.\n• Can help alleviate pain cause by sciatica.\n• Improves balance.\n• The lifting of the torso and arms helps build strength in the arms, shoulders, and back.\n• Balancing in this pose helps strengthen the deep core."
    },
    {
      "passioID": "1003702",
      "name": "Ardha Chandrasana",
      "sanskrit": "अर्धचन्द्रासन",
      "english": "Half moon",
      "type": "Standing",
      "description": "The name comes from the Sanskrit words अर्ध ardha meaning \"half\", चन्द्र candra meaning \"moon\", and आसन āsana meaning \"posture\" or \"seat\".The 19th century Sritattvanidhi uses the name Ardha Chandrasana for a different pose, Vrikshasana.Swami Yogesvarananda used the name in his 1970 First Steps to Higher Yoga for a pose similar to Kapotasana, Pigeon.The modern usage of the name is found in B. K. S. Iyengar's 1966 Light on Yoga.",
      "url": "https://en.wikipedia.org/wiki/Ardha_chandrasana",
      "benefits": "• Strengthens ankles, knees and legs\n• Roots thighbones to help alleviate backpain\n• Strengthens abdomen, buttocks and spine\n• Opens chest and shoulders\n• Improves digestion\n• Reduces anxiety, depression\n• Improves balance, coordination\n• Relives stress"
    },
    {
      "passioID": "1003703",
      "name": "Ashtanga Namaskara",
      "sanskrit": "अष्टाङ्ग नमस्कार",
      "english": "Eight-Limbed Salutation",
      "type": "Reclining",
      "description": "Ashtanga Namaskara is a prone posture with eight parts of the body in contact with the ground: both feet, both knees, both hands, the chest, and either the chin or the forehead.The hands are below the shoulders, the elbows bent.The pose has been used as an alternative to Chaturanga Dandasana in the Surya Namaskar sequence, considered suitable for practitioners lacking the strength to do the usual pose; arguments against this usage include compression of the lower back and stress on the shoulder join. It was used in the early Surya Namaskar of Pant Pratinidhi, with the forehead touching the ground",
      "url": "https://en.wikipedia.org/wiki/Ashtanga_Namaskara",
      "benefits": "• Strengthens your biceps.\n• Strengthens rhomboids and trapezius muscles on your back.\n• Stretches the fascia in the soles of your feet.\n• Stretches your toes.\n• Can help increase range of motion for back bends.\n• Strengthens your hands and forearms.\n• Strengthens your quads and hip flexors.\n• If done with awareness, can help connect to your deep core, tone your transverse abdominus, and thus help prevent lower back pain in the pose."
    },
    {
      "passioID": "1003704",
      "name": "Astavakrasana",
      "sanskrit": "अष्टावक्रासन",
      "english": "Aṣṭāvakra's pose",
      "type": "Balancing",
      "description": "Astavakrasana is a hand balance with lateral twist. The pose is entered from a squatting position, one arm between the feet, the other just outside the other foot, palms on the floor. Pushing up and lifting both legs from the floor gives a variant or preparatory position, with both legs bent, one leg over one forearm, the other leg crossed over the first at the ankle. Straightening the legs gives the full pose.",
      "url": "https://en.wikipedia.org/wiki/Astavakrasana",
      "benefits": "• Builds strength in your arms (biceps and triceps), shoulders and wrists extensors.\n• Strengthens your Gluteus Minimus, Gluteus Medius and Gluteus Maximus.\n• Strengthens your quadriceps.\n• Strengthens your leg/hip adductors (inner thighs).\n• Strengthens your ankles.\n• Tones and strengthens your pelvic floor.\n• Strengthens your abdominal muscles, building core strength.\n• Tests your ability to focus.\n• Improves your ability to balance.\n• Stretches your hamstrings.\n• Stretches your wrist flexors.\n• Stretches your pectoralis major and can help open your chest.\n• The focus the pose demands may help relieve stress."
    },
    {
      "passioID": "1003705",
      "name": "Baddha Konasana",
      "sanskrit": "बद्धकोणासन",
      "english": "Bound angle",
      "type": "Sitting",
      "description": "From sitting position with both the legs outstretched forward, hands by the sides, palms resting on the ground, fingers together pointing forward, the legs are hinged at the knees so the soles of the feet meet. The legs are grasped at the ankles and folded more until the heels reach the perineum. The knees move down to the ground, and with practice reach there; the body is erect and the gaze in front. The asana is held before coming back to the starting position. The thighs are stretched with care. When used for meditation, the hands are placed in Anjali mudra (prayer position) in front of the chest.\nThe pose strongly opens hip and groin,and is one of the few yoga asanas that can be practiced comfortably soon after eating, except for the forward-bending variation with the head on the floor. It is claimed in Light on Yoga, citing Grantly Dick Reed's Childbirth Without Fear, that the pose is beneficial to pregnant women, as regular practice reduces pain during delivery.If there is a groin or knee injury, the knees must be supported on folded blankets.",
      "url": "https://en.wikipedia.org/wiki/Baddha_Konasana",
      "benefits": "• Strengthens and improves flexibility in the inner thighs, groins and the knees\n• Helps prepare the hips and groins for meditative seated poses, which require more flexibility in these areas\n• Helps to sooth menstrual discomfort and digestive complaints\n• Stimulates the abdominal organs, potentially improving the health of the ovaries, prostate gland, kidneys and bladder.\n• Alleviates fatigue, according to traditional yoga texts\n• Helps open up the lower back and relieves sciatica\n• Metaphysically opens up the groin area helping to relieve sexual inhibitions and guilt."
    },
    {
      "passioID": "1003706",
      "name": "Bakasana",
      "sanskrit": "बकासन",
      "english": "Crane (arms straight)",
      "type": "Balancing",
      "description": "These asanas are arm balances. In Crow Pose, the knees rest on the bent elbows. In Crane Pose, the elbows are straight and the knees are just above the shoulders, requiring flexibility in the hips.According to B.K.S. Iyengar there are two techniques for entering the poses. The simple method is by pushing up from a crouching position. The advanced method is to drop down from Shirshasana (yoga headstand).Some vinyasa yoga practitioners jump in and out of Crane/Crow via Downward-Facing Dog Pose. This can be practised in stages.",
      "url": "https://en.wikipedia.org/wiki/Bakasana",
      "benefits": "• Maximum use of the core muscles and hence also strengthening them.\n• Strengthens the arms and the shoulders with the balance.\n• Improves co-ordination with mind, body and breath for better balance.\n• Brings more awareness to the body, improving balance\n• Strengthens the hips and the gluteus maximus muscles.\n• Improves the overall confidence in the body and the mind.\n• Builds physical strength and improves overall flexibility.\n• Teaches you to keep the body light and flexible, which helps in the practice of advance poses.\n• Builds endurance, giving more stability with the breathing.\n• Overall improvement with the backbone, with strength and flexibility\n• Crane Pose helps to work with the digestive system, improving it."
    },
    {
      "passioID": "1003708",
      "name": "Balasana",
      "sanskrit": "बालासन",
      "english": "Child",
      "type": "Sitting",
      "description": "From a kneeling position, bring the forehead to the floor and relax the arms alongside the body, palms upwards.",
      "url": "https://en.wikipedia.org/wiki/Balasana",
      "benefits": "• The balasana yoga or the asana helps release any tension in the chest. It is also why people trust yoga for better sleep.\n• It relaxes the back and spine and enables people to trust in yoga for good sleep.\n• It alleviates the stress felt by your shoulders and hands.\n• The Child Pose is highly recommended to people who keep feeling dizzy.\n• This sleeping asana pose, if practised after a tiring workday or workout, can help with relaxation and soothing of the muscles, ensuring good sleep.\n• This pose helps alleviate stress and feelings of anxiety. This is considered as one of the top benefits of child pose. \n• Since the Balasana Yoga for sleep flexes the internal organs of your body, it helps in keeping them active, and therefore, supple.\n• This stretch helps in the lengthening of the spine, and in maintaining its natural alignment.\n• When this yoga for better sleep pose is performed with support on the head and the upper part of the body, the Child Pose can give relief from the pain felt in the lower back and the neck.\n• It gives a good stretch to the legs, ankles, thighs, and hips.\n• Performing this yoga before sleep helps lower your blood pressure.\n• By stretching out the whole body with the help of a pillow, the Balasana Yoga for sleep improves blood circulation.\n• It enhances the quality of breathing, and thus, soothes the body as well as the mind. This is why yoga before sleep is a good habit. Many people trust yoga for good sleep.\n• The muscles, tendons, and ligaments in your knees and legs receive the stretch they need through the Child Pose."
    },
    {
      "passioID": "1003710",
      "name": "Bhairavasana",
      "sanskrit": "भैरवासन",
      "english": "Formidable",
      "type": "Reclining",
      "description": "The pose is a reclining posture with one leg stretched straight out, and the foot of the other leg behind the neck. The hands are held in prayer position in front of the chest. In the variant pose Kala Bhairavasana, the arm on the side with the bent leg is held out straight, supporting the body, while the arm on the side with the straight leg is held out, straight up.",
      "url": "https://en.wikipedia.org/wiki/Bhairavasana",
      "benefits": "• This pose regulates blood circulation in your body, due to which you do not have any blood-related disease.\n• This asana helps in keeping your mind under control.\n• This pose helps to maintain a balance between your body and mind.\n•  By doing this asana, anxiety, and stress start coming out of the mind.\n•  This posture sharpens your brain and improves your concentration power.\n•  This pose makes your hip, thigh, and back muscles flexible and strong.\n•  By doing this pose, your stomach problem like gas, indigestion, and constipation problem is over.\n•  This posture increases your metabolism rate which causes your weight loss.\n•  This posture helps in beautifying your body texture.\n•  Doing this posture never causes pain in your neck and back.\n•  This pose boosts your confidence.\n•  This pose increases immunity in your body"
    },
    {
      "passioID": "1003711",
      "name": "Bharadvajasana",
      "sanskrit": "भरद्वाजासन",
      "english": "Bharadvaja's twist",
      "type": "Sitting",
      "description": "Bharadvājāsana is a seated spinal twist. Bharadvajasana I is the basic form, with the legs as in Virasana (hero pose), one foot on the floor and the other ankle cradled in the arch of the foot below.Badha Konasana and Marichyasana can be used to prepare for Bharadvajasana.",
      "url": "https://en.wikipedia.org/wiki/Bharadvajasana",
      "benefits": "•  Improves flexibility of knees, spine and arms giving good range of motion.\n•  The twisting and squeezing effect on abdominal organs aids for better digestion and boosts the metabolism.\n•  This asana is good for Pregnant woman in the second trimester to strengthen the lower back, however attempt doing the pose only after consulting the doctor and must twist only based on their own flexibility rather forceful attempt.\n•  This pose is good for carpal tunnel syndrome.\n•  The blood circulation and lymphatic circulation is improved.\n•  Bharadvajasana is a pose known to relieve stress.\n•  This pose may help in improving the respiration rate.\n•  As like other twisting pose this pose reduces the love handles or oblique fat and also belly fat.\n•  This is one of the remedial posture for sciatica."
    },
    {
      "passioID": "1003714",
      "name": "Bhekasana",
      "sanskrit": "भेकासन",
      "english": "Frog",
      "type": "Reclining",
      "description": "The pose is entered from a prone position. The arms reach back, the knees are bent and the hands catch the feet, pressing them down. The arms are reversed so that the elbows point upwards and the fingertips downwards. The head and chest are lifted, and the gaze is directed upwards. In the completed pose, the feet reach the floor.",
      "url": "https://en.wikipedia.org/wiki/Bhekasana",
      "benefits": "• First, it boosts the functioning of the adrenal glands by deep stretching the kidney and the stomach. By activating the adrenal glands, there is an influx of energy to the body. It also causes pressure in the lower abdomen, which stimulates the release of good hormones promoting digestion.\n• Promotes the functioning of the reproductive and other internal organs. For example, the frog posture gives a deep stretch because all the internal organs are activated along with the various hormones needed for the proper function of the reproductive system.\n• The backbend involved in the yoga half frog pose and the yoga frog pose improves mobility. \n• It also increases the flexibility and range of motion in the various parts of the body. It also stretches the hips and legs, opening the muscles aiding in stronger legs. The upper body also gets a deep stretch hence the arms, shoulders, and chest benefit.\n• In the Bhekasana, the body is bent backwards, and there is enough pressure on the chest and the lungs. That means the chest muscles get a stretch which increases the breathing capacity.\n• Practising Bhekasana yoga needs a lot of body balance and control. There is pressure on the shoulders, chest, hands and back. Because of this, the muscles get a massage, which increases stamina and body control.\n• Promotes better overall body posture, strengthens back muscles, hip joints, and knee joints.\nIt relieves stress, anxiety and calms the mind and body."
    },
    {
      "passioID": "1003656",
      "name": "Bhujangasana",
      "sanskrit": "भुजंगासन",
      "english": "Cobra",
      "type": "Reclining",
      "description": "The pose may be entered from a prone position or from Downward Dog. The palms are placed under the shoulders, pushing down until the hips lift slightly. The backs of the feet rest on the ground, the legs outstretched; the gaze is directed forwards, giving the preparatory pose. For the full pose, the back is arched until the arms are straight, and the gaze is directed straight upwards or a little backwards. The legs remain on the ground, unlike in the similar Upward Dog pose.Salabhasana, Locust pose, or Sphinx pose can be used to prepare for bhujangasana.\nBhujangasana is part of the sequence of yoga postures in some forms of Surya Namaskar, the Salute to the Sun.Balasana, child's pose, is a counter pose for bhujangasana.",
      "url": "https://en.wikipedia.org/wiki/Bhujangasana",
      "benefits": "• Opens up the shoulders and neck to relieve pain\n• Tones the abdomen\n• Strengthens the entire back and shoulders\n• Improves flexibility of the upper and middle back\n• Expands the chest\n• Improves blood circulation\n• Reduces fatigue and stress\n• Useful for people with respiratory disorders such as asthma"
    },
    {
      "passioID": "1003715",
      "name": "Bhujapidasana",
      "sanskrit": "भुजपीडासन",
      "english": "Arm-pressing posture",
      "type": "Balancing",
      "description": "Bhujapidasana is an arm supported asana in which the base of support are the palms of the hands. It requires both balance and strength to maintain.\nThe variant Eka Hasta Bhujasana or Elephant's Trunk Pose has one leg stretched out straight forward between the supporting arms.",
      "url": "https://en.wikipedia.org/wiki/Bhujapidasana",
      "benefits": "• It is beneficial in a headache, as well as mild anxiety.\n• Regular practicing by Tittibhasana will control your heart rate as well as improves blood circulation in the body.\n• Bhujapidasana strengthens your wrists, hands, chest, shoulder and your upper body.\n• Shoulder-Pressing Pose can help tones the abdominal muscles and internal organs.\n• This pose strengthens the arms and tone the wrist. that will build up the grip strength in the future. \n• It works for calms the mind.\n• It promotes your metabolism.\n• This asana will improve your overall balance both mentally and physically."
    },
    {
      "passioID": "1003716",
      "name": "Bidalasana",
      "sanskrit": "बिडालासन",
      "english": "Cat",
      "type": "Kneeling",
      "description": "The practitioner kneels on all fours and slowly raises and lowers the back, transitioning in a gentle vinyasa between Cat and Cow Poses, and exercising the core muscles that support the spine.\nThe pose is considered in Sivananda Yoga to be suitable for use during pregnancy.",
      "url": "https://en.wikipedia.org/wiki/Bidalasana",
      "benefits": "• Improves the flexibility of the spine\n• Improves the prana in the body while flexing the spine\n• Relieves tensions around the lower back, middle back, neck and shoulders\n• Engages the core muscles to the maximum, making it strong\n• Strengthens the arms, shoulders and the wrists\n• Strengthens the hip joints, the knee joints and the shoulder joints\n• Gently massages the abdominal muscles, thereby improving digestion\n• Great pose to reduce stress, insomnia and encourages good sleep\n• Improves the body posture\n• A great pose to reduce symptoms related to PMS\n• A good pose to practice for Prenatal and Postnatal\n• Considered a great foundation pose for most advance backbend poses.\n• Like most poses, the Cat Pose brings awareness of the body and the breath.\n• Anyone suffering from Fibromyalgia can practice this pose in a restorative way.\n"
    },
    {
      "passioID": "1003718",
      "name": "Chaturanga Dandasana",
      "sanskrit": "चतुरङ्गदण्डासन",
      "english": "Four-Limbed Staff\nLow Plank",
      "type": "Reclining",
      "description": "In Chaturanga Dandasana the hands and feet are on the floor, supporting the body, which is parallel to and lowered toward, but not touching, the floor. It looks much like a push up, but with the hands quite low (just above the pelvis), and the elbows kept in along the sides of the body.\nIn vinyasa styles of yoga, Chaturanga Daṇḍasana is part of the Surya Namaskar (Salute to the Sun) asana sequence, performed on an exhale. In Ashtanga vinyasa yoga's Surya Namaskar A it is the fourth asana, and in Surya Namaskar B it is the fourth, eighth and twelfth asanas.\nIn yoga practice without vinyasas, the posture is simply held for a period of time (for instance, 30 seconds) with continuous breathing.",
      "url": "https://en.wikipedia.org/wiki/Chaturanga_Dandasana",
      "benefits": "• Strengthens the core.\n• Builds strength in the quads.\n• Builds strength in shoulders and scapula stabilizers when practiced with proper alignment.\n• Great preparation for more arm balances.\n• Strengthens biceps and triceps as well as forearm muscles.\n• Strengthens pectoralis major.\n• Builds flexibility and strength in the wrists.\n• Builds strength in back extensors (erector schaae).\n• Develops core stability as you work to hold your body straight.\n• Prepares body for inversions."
    },
    {
      "passioID": "1003719",
      "name": "Dandasana",
      "sanskrit": "दण्डासन",
      "english": "Staff",
      "type": "Sitting",
      "description": "The asana is entered from a seated position with the legs extended forward. The palms or the fingertips (if the palms don't reach) should be rested on the ground either side of the body. The upper-body should be extending upward through the crown of the head, and the back should be completely perpendicular to the ground (as though sitting against a wall). If this is not possible, a block may be placed underneath the sitting bones. The legs should be squeezing together, and the toes should be pointing inwards toward the body. It may even be possible to create space between the heels and the ground by activating the leg muscles.",
      "url": "https://en.wikipedia.org/wiki/Dandasana",
      "benefits": "• Stretches your hamstrings.\n• Strengthens your quads.\n• Helps improve posture.\n• Strengthens your main back muscles — the erector spinae.\n• Strengthens hip flexors — your psoas has to work a lot!\n• Builds strength in your pelvic floor muscles.\n• Your core strengthens from the work to hold you upright.\n• Opens your chest.\n• Improves core stability.\n• Can help lessen the pain of sciatica"
    },
    {
      "passioID": "1003722",
      "name": "Dhanurasana",
      "sanskrit": "धनुरासन",
      "english": "Bow",
      "type": "Reclining",
      "description": "From a prone position, the feet are grasped to lift the legs and chest to form the shape of a bow with the body, with the arms representing the bowstring.Balasana can be used as a counter pose.",
      "url": "https://en.wikipedia.org/wiki/Dhanurasana",
      "benefits": "• Effective in weight loss.\n• Improves digestion and appetite.\n• Helps to cure dyspepsia (obesity), rheumatism, and gastrointestinal problems.\n• Cures constipation.\n• Improves blood circulation.\n• Gives flexibility to the back.\n• Strengthens back muscles.\n• Improve the function of the liver, pancreas, small intestine, and big intestine.\n• Act as a stress reliever.\n• Strengthens ankles, thighs, groins, chest, and abdominal organs.\n• Cure menstruation disorder.\n• Improve the function of kidney and liver.\n• It improves posture.\n• Releases back pain.\n• Cures respiratory disorder like asthma.\n• Helpful is stimulating reproductive organs.\n• Improve the function of the pancreas and it is beneficial in diabetes."
    },
    {
      "passioID": "1003724",
      "name": "Durvasasana",
      "sanskrit": "दुर्वासासन",
      "english": "Durvasa's Pose",
      "type": "Standing, Balancing",
      "description": "Durvasasana is an advanced standing balancing pose with one leg behind the neck;the hands are held together over the chest in prayer position.As well as rating the pose of difficulty level 21 (out of 60), B. K. S. Iyengar states that it is difficult to balance in the pose, and recommends using a support to begin with.In Ashtanga Vinyasa Yoga, the breathing in the pose is stated to be either natural or ujjayi.",
      "url": "https://en.wikipedia.org/wiki/Durvasasana",
      "benefits": "• Excellent hip opener; it combines strength with flexibility.\n• It's a great stretching for your hips, hamstrings, and glutes, working on flexibility and mobility.\n• Strengthens the muscular, nervous and circulatory systems.\n• Sage Durvasa's Pose improves balance and concentration.\n• Helps reduce fatigue and stress, promotes mindful breathing and makes you feel relaxed and calm."
    },
    {
      "passioID": "1003725",
      "name": "Garbha Pindasana",
      "sanskrit": "गर्भासन",
      "english": "Embryo in Womb",
      "type": "Sitting",
      "description": "The legs are crossed in Padmasana; practitioners who cannot easily keep the feet in Padmasana may cross the legs in Sukhasana. The arms are threaded through behind the knees, and the hands then reach up to grasp the ears. The body is then balanced on the coccyx (the tailbone).\nIn Ashtanga Vinyasa Yoga, the pose is in the primary series.",
      "url": "https://en.wikipedia.org/wiki/Garbha_Pindasana",
      "benefits": "• It relaxes the whole spine, especially the muscles of the lumbar spine.\n• Helpful for abdominal cramps and strengthens all abdominal muscles.\n• It cleans and tones the liver and spleen and strengthens the uterus and rectum.\n• It activates the first three chakras.\n• Garbha Pindasana is very effective in opening the hip joints even further making your lotus more comfortable.\n• This asana is believed to help in a spiritual union between one's mind and soul.\n• The abdomen remains shapely and slim due to total contraction during the posture.\n• The digestive system of the body improves due to the regular practice of this posture It also treats all kinds of stomach illnesses.\n• The yoga posture provides exercise to both the upper and the lower body of the performer."
    },
    {
      "passioID": "1003728",
      "name": "Garudasana",
      "sanskrit": "गरुडासन",
      "english": "Eagle",
      "type": "Standing, Balancing",
      "description": "Garudasana is an asymmetric position in which one leg, say the right, is crossed over the left, while the arm on the opposite side, say the left, is crossed over the right, and the palms are pressed together. Like all poses on one leg, it demands, and may help to build, balance and concentration.According to Satyananda Saraswati, the two palms pressed together resemble the eagle's beak. The gaze is directed at a fixed point in front.",
      "url": "https://en.wikipedia.org/wiki/Garudasana",
      "benefits": "• Stretches your upper back and shoulders.\n• Strengthens your ankles, calves, and knees.\n• Also stretches calf (leg on bottom stretches, leg on top strengthens when plantar flexed).\n• Improves balance.\n• Can helps alleviate sciatica if practiced without straining excessively.\n• Builds strength in hip stabilizers.\n• Strengthens ankles and increase flexibility in shoulder joints.\n• Said to help build concentration which can help with your mediation practice.\n• Builds strength in the intrinsic muscles of your feet.\n• Strengthens your hamstrings.\n• Builds strength in your core.\n• Can help release tightness in your lower back."
    },
    {
      "passioID": "1003729",
      "name": "Gomukhasana",
      "sanskrit": "गोमुखासन",
      "english": "Cow-faced",
      "type": "Sitting",
      "description": "The pose is entered from kneeling by crossing the legs; the heel of the upper leg is tucked in under the lower thigh near the buttock. The arm on the lower leg side is raised, the forearm bent down, while the other arm reaches down behind the back, the forearm bent up, so the hands can clasp between the shoulder blades.\nThe sitting position can be modified either by putting a folded blanket on the heels, and if need be also one beneath them.\nThe pose stretches the shoulders. The hand position can be modified using a strap to extend the reach for those who cannot bring the hands together behind the back.The pose is contra-indicated for people with a rotator cuff injury.\nPreparatory poses for Gomukhasana include Baddha Konasana and Garudasana. Counter poses include Dandasana, Paschimottanasana, and Purvottanasana.",
      "url": "https://en.wikipedia.org/wiki/Gomukhasana",
      "benefits": "• Treats sciatica\n• Treats high blood pressure\n• Enhances sexual performance\n• Cures stiff and frozen shoulders\n• Elongates spine and improves bad posture\n• Reduces anxiety and stress\n• Stimulates kidneys\n• Strengthens the muscles of the back, hips, ankles, shoulders, thighs, inner armpits, triceps, and chest"
    },
    {
      "passioID": "1003731",
      "name": "Halasana",
      "sanskrit": "हलासन",
      "english": "Plough",
      "type": "Inversion",
      "description": "The pose is entered from Sarvangasana (shoulderstand), lowering the back slightly for balance, and moving the arms and legs over the head until the outstretched toes touch the ground and the fingertips, in a preparatory variant of the pose. The arms may then be moved to support the back into a more vertical position, giving a second variant pose. Finally, the arms may be stretched out on the ground away from the feet, giving the final pose in the shape of a traditional plough.",
      "url": "https://en.wikipedia.org/wiki/Halasana",
      "benefits": "• Halasana helps in making us more flexible and agile by working on the flexibility of the spine. \n• This in turn helps in doing the daily activities better and being mobile.\n• It is a very effective pose for people suffering from recurrent headaches due to hypertension, migraine, or sinusitis.\n• One of the most important advantages of Halasana is that it massages our digestive organs. This helps in relieving and preventing digestive disorders like constipation, flatulence, bloat, etc.\n• Another Halasana benefits is that it revitalises the spleen and the suprarenal glands and improves the production of insulin. This helps in not only improving the functioning of the kidneys and liver but also in preventing type-2 diabetes.\n• One of the most critical Halasana benefit is that it regulates the activity of the thyroid gland. \n• This is beneficial for people who are suffering from thyroid in managing their symptoms.\nHalasana stimulates the thymus gland. This supports and improves the functioning of the immune system that helps in preventing diseases and infections.\n• An important Halasana benefit is that it works on the strength of not only the back muscles but also the ligaments, tendons, and tissues in the hamstrings and abdominal muscles. This helps in improving mobility and athletic performance.\n• Halasana is an excellent posture for improving blood circulation. This is essential for our organs to function properly, avoid diseases and infections, and keep our skin and hair healthy.\n• Halasana, especially when performed along with Surya Namaskar poses, improves blood circulation, helps the brain in receiving more oxygen, which supports better cognitive functioning and prevents memory loss, dementia, Alzheimers, and Parkinsons.\n• Halasana asana by improving the blood circulation helps in detoxifying the body and preventing exhaustion, tiredness, and inability to concentrate.\n• It helps in stimulating the reproductive organs. For women, this helps in preventing menstrual discomfort and painful symptoms of menopause. For men, it helps in preventing fertility issues.\n• Halasana is very effective in preventing headaches that may occur due to migraine or sinusitis.\nSince Halasana works on your entire body, it is a great pose of yoga for weight loss, especially for the excess weight on the belly and the thighs."
    },
    {
      "passioID": "1003733",
      "name": "Hanumanasana",
      "sanskrit": "हनुमनासन",
      "english": "Hanuman's Pose",
      "type": "Sitting",
      "description": "Hanumanasana is an advanced pose (rated 36 out of 64 by B. K. S. Iyengar). The pose is approached from a kneeling position, stretching one leg forward and the other straight back while supporting the body with the hands until the full pose is mastered. The hands may then be placed in prayer position (Anjali Mudra). Finally, the arms may be stretched above the head, and the palms joined together. Iyengar states that to reach the full pose, one must make \"several attempts each day\" and be prepared to work at it for \"a long time\".",
      "url": "https://en.wikipedia.org/wiki/Hanumanasana",
      "benefits": "• Increases Range of Motion\n• Practicing this Helps to Prevent Injuries\n• Improves Digestion\n• Tones Abdominal Organs\n• Develops Courage\n• Stimulates Reproductive and Digestive Organs\n• It Helps in Sciatica\n• It Helps in Leg Cramps\n• Reduces Stress and Anxiety\n• It Cures Tightness Caused in the Groin Area\n• It Strengthens Quadriceps Muscles\n• It helps to relieve tensions from the hip joint.\n• It releases muscles around the hip joint.\n• Hanumanasana also relieves Sciatica.\n• Increases (Range of Motion) ROM.\n• Prevents the risks of getting an injury.\n"
    },
    {
      "passioID": "1003735",
      "name": "Janusirsasana",
      "sanskrit": "जानुशीर्षासन",
      "english": "Head-to-Knee",
      "type": "Sitting",
      "description": "In a seated position, one leg is extended with toes pointing upward, and the other leg is bent with knee pointing away from the straight leg and the sole of the foot in by the groin. The torso turns and folds over the extended leg.",
      "url": "https://en.wikipedia.org/wiki/Janusirsasana",
      "benefits": "• It calms the brain and eliminates mild depression;\n• It stretches the spine, liver, spleen, hamstrings, groins, and shoulders;\n• Stimulates the kidneys and liver;\n• Reduces pain in the waist and legs;\n• Helps to get rid of belly fat;\n• Improves digestion;\n• Relieves symptoms of menopause;\n• Effectively strengthens rib bones;\n• The asana also makes the spine flexible;\n• The asana is therapeutic for insomnia, high blood pressure;\n• Can cure sinusitis."
    },
    {
      "passioID": "1003736",
      "name": "Kapotasana",
      "sanskrit": "कपोतासन",
      "english": "Pigeon",
      "type": "Kneeling",
      "description": "A pose from the Ashtanga tradition, Kapotasana is an advanced asana which resembles Chakrasana, or Wheel Pose. The shins and forearms are on the ground, the front body stretched upwards in the air. The pose is reached by going into a backbend with knees on the ground. It requires flexibility to bring the head back until it reaches the ground. Kapotasana helps to open up the chest, and strengthens the back and groin. It opens and increases the flexibility of the hips,at the same time strengthening the back, and stretching the thighs and the groin.\nIn Iyengar Yoga, practitioners begin by lying in Supta Virasana, bending the arms and placing the arms beside the head. They then press the hands, exhale and raise the hips and trunk. The crown of the head can be placed on the floor, and hands can be walked towards the feet by raising the trunk higher.",
      "url": "https://en.wikipedia.org/wiki/Kapotasana",
      "benefits": "• Opens tight hips by stretching the thighs, groin, back, piriformis, and psoas muscle\n• Increases external rotation of the femur in the hip socket and lengthens hip flexors, creating more flexibility in the hips\n• Stretches the muscles, tendons, and ligaments around the knees, and increases circulation in these areas\n• Improves posture and respiration\n• Alleviates back pain\n• Draws the focus inward, calming the mind\n• Opens up the cervical region and the shoulder joints\n• Removes accumulated stress from the neck region\n• Stimulates the thymus gland, improving immune function\n• Helps relieve sciatica, colitis, and piles\n• Improves blood circulation to the muscles of the pelvic floor\n• Helps get rid of excess visceral fat\n• Prepares you for seated postures and backbends"
    },
    {
      "passioID": "1003738",
      "name": "Kraunchasana",
      "sanskrit": "क्रौञ्चासन",
      "english": "Heron",
      "type": "Sitting",
      "description": "The pose is accomplished by sitting with one knee forwards on the ground and the foot beside the hip, as in Virasana. The other leg is straight and raised to touch the nose and chin; the foot is grasped by both hands. This provides a stronger forward bend than Paschimottanasana.The posture is stated to be unsuitable during menstruation.",
      "url": "https://en.wikipedia.org/wiki/Kraunchasana",
      "benefits": "• The Heron pose is best forward bend Asana, by which you’ll get a good stretch at your legs, back, hamstrings, knees, calves, and hips.\n• Krounchasana is amazing hips opener Pose.\n• The Heron Pose tones your abdominal organs as well as stretches your chest.\n•  People who are facing the problems regarding flat foot, then definitely The Heron pose is solved your problem.\n• Good for your digestive system, and it cures problems related to gas."
    },
    {
      "passioID": "1003739",
      "name": "Kurmasana",
      "sanskrit": "कूर्मासन",
      "english": "Tortoise",
      "type": "Sitting",
      "description": "To enter kūrmāsana a practitioner sits with the legs outstretched, feet as wide apart as possible. The knees are bent slightly, keeping the heels in contact with the floor. The body is leaned forward from the hips and the hands slid under the knees. The body leans forward (bending at the hips) to allow the hands and arms to slide sideways and backward (under the knees) until the elbows lie near the back of the knees. The heels are pushed forward and legs are straightened as much as possible. The forehead or chin is brought to touch the floor. The arms are further brought around the back to interlock the hands under the buttocks.",
      "url": "https://en.wikipedia.org/wiki/Kurmasana",
      "benefits": "• Toning the abdominal area\n• Stimulating the digestive system along with kidneys and liver\n• Stimulating the muscles\n• Relieving lower back issues\n• Reducing sciatica pain\n• Makes your hips and shoulders more flexible\n• Enhancing blood circulation\n• Reducing stress and anxiety\n• Opening up the chest and lungs\n• Managing asthma symptoms\n• Reducing the risk of neurodegenerative diseases like Parkinson's and Alzheimer's"
    },
    {
      "passioID": "1003741",
      "name": "Lolasana",
      "sanskrit": "लोलासन",
      "english": "Pendant",
      "type": "Balancing",
      "description": "The practitioner kneels with ankles crossed over each other allowing the buttocks to rest in the cradle of the heels. Places hands besides folded legs and leans forward slowly to curve back and shoulder blades pressing the shoulders towards the floor. Raises legs off the ground holding in this pose for at least 20 seconds.",
      "url": "https://en.wikipedia.org/wiki/Lolasana",
      "benefits": "• Strengthens the arms, wrists, and shoulders.\n• Builds upper body strength and core strength.\n• It generates control, coordination and agility.\n• Improves focus.\n• Boosts energy in the body.\n• Regular Practice will develop strong shoulders for inversions and deeper arm balances."
    },
    {
      "passioID": "1003742",
      "name": "Makarasana",
      "sanskrit": "मकरासन",
      "english": "Crocodile",
      "type": "Reclining",
      "description": "In Light on Yoga, B. K. S. Iyengar notes that the Gheranda Samhita describes the pose as lying prone with both legs \"stretched out\"; the head is caught in the arms, and the pose is said to \"increase bodily heat\". Iyengar describes it as a variation of Salabhasana, locust pose and illustrates it as such, with the head and legs raised energetically, the fingers interlocked clasping the back of the head, and the elbows high off the ground.\nMakarasana is however often used as a relaxation asana, an alternative to the supine Shavasana, and both head and legs are rested on the floor. Yoga International describes it as having the chest \"slightly raised\", and as \"one of the best postures for working with diaphragmatic breathing\".",
      "url": "https://en.wikipedia.org/wiki/Makarasana",
      "benefits": "• Makarasana offers deep relaxation for your shoulders and spine\n• It can treat asthma and any lung-related issues\n• It helps in curing slip disc, spondylitis, and sciatica\n• The asana stretches the hip muscles\n• It relaxes your body completely and keeps you rejuvenated\n• It relieves the body and the mind of tension\n• Makarasana treats hypertension, heart diseases, and mental disorders\n• It stretches the muscles of the abdomen, chest, and neck, relieving fatigue and aches in those areas\n• The asana keeps backache at bay\n• Makarasana helps you to breathe slowly, efficiently, and deeply\nIt keeps you alert\n• The asana turns your mind inward, calming it and preventing anxiety\n• Makarasana releases all the tight knots in your body and makes it flexible"
    },
    {
      "passioID": "1003743",
      "name": "Malasana",
      "sanskrit": "मालासन",
      "english": "Garland",
      "type": "Squatting",
      "description": "The name malasana is sometimes used in the West for the \"regular squat pose,\" Upaveshasana,in which the palms of the hands are folded together in Anjali Mudra (prayer posture) in front of the chest, and the feet are set apart. Yoga Journal states that Malasana stretches the ankles, groins and back, and tones the belly, but cautions about using the asana when there are lower back or knee injuries. A variant of this pose, Prapadasana, has the heels together and the feet on tiptoe.",
      "url": "https://en.wikipedia.org/wiki/M%C4%81l%C4%81sana",
      "benefits": "• Opens your hips and groin\n• Stretches your ankles, lower hamstrings, back and neck\n• Tones your abdominals\n• Aids in digestion\n• Strengthens your metabolism\n• Keeps your pelvic and hip joints healthy\n• Ideal for prenatal yoga"
    },
    {
      "passioID": "1003744",
      "name": "Marichyasana",
      "sanskrit": "मरीच्यासन",
      "english": "Marichi's Pose",
      "type": "Sitting",
      "description": "This twisting asana is normally performed sitting. In Marichyasana I, one leg is stretched out straight ahead of the body, the other is bent with the sole of the foot on the floor and the knee up beside the body. The body is twisted towards the side with the straight leg, and the arms are clasped behind the back and around the raised knee. The body may then lean forwards until the nose and chin touch the straight leg.",
      "url": "https://en.wikipedia.org/wiki/Marichyasana",
      "benefits": "• Stimulates liver and kidneys function: Each organ of the body plays a vital role in fostering health and wellness and so do the liver and kidneys. The liver regulates the chemical levels in blood and excretes a product called ‘bile’. The Kidneys filter blood by-products and eliminate waste. The Marichyasana functions to keep these organs in an optimal state of performance.\n• Enhances digestive functions: The process of digestion is crucial in manifesting a robust health and well-being. Sage Marichi’s pose greatly improves the digestive functions providing relief from issues like constipation, indigestion, bloating, acidity, etc. Afterall, “A Good digestion turneth to all health.” — George Herbert.\n• Amplifies blood circulation: The Marichyasana increases blood circulation in the body, especially around the abdominal areas. Our abdominal area consists of vital organs and an enhanced supply of blood to these areas results in good health of these abdominal organs.\n• Supports healthy brain Functions: The brain is the powerhouse of the body and it’s important to take care of this central organ of the nervous system. The daily practice of Marichyasana triggers healthy brain functions and supports a happy nervous system capable of developing sensations of peace and calmness. A serene mind ultimately translates to a relaxed body.\n• Healthy Squeezing of Internal Organs: The Sage Marichi’s pose is asserted for massaging the internal organs that cleanse them and stimulates their functioning. Proper working of internal organs keeps the human body in the peachiest state, both internally and externally.\n• Twisting Benefits for the Body: The Marichyasana encourages the pelvis and shoulders to rotate in opposite directions, creating a twist in the upper body. The twists are generally helpful for detoxifying the stomach, maintaining spinal rotation, reduction in back pain, de-stressing, and so much more. Honor the health benefits of Marichyasana and twists simultaneously while being in this pose.\n• Strengthens the Shoulders: The dedicated practice of the Marichyasana with correct alignment of the shoulders is highly beneficial for the shoulder blades. The stance of the pose builds strength in the shoulders leading to an ease in movements and less shoulder damage."
    },
    {
      "passioID": "1003746",
      "name": "Matsyasana",
      "sanskrit": "मत्स्यासन",
      "english": "Fish",
      "type": "Reclining",
      "description": "The asana is a backbend, where the practitioner lies on his or her back and lifts the heart (anahata) chakra by rising up on the elbows and drawing the shoulders back. The neck is lengthened, and the crown of the head Sahasrara chakra is \"pointed\" toward the 'wall' behind the practitioner. As the arch of the back deepens with practice, and the heart and throat open further, the top of the head may brush the ground, but no weight should rest upon it.",
      "url": "https://en.wikipedia.org/wiki/Matsyasana",
      "benefits": "• Stretches your deep hip flexors and intercostals (muscles between the ribs)\n• Relieves tension in your neck, throat, and shoulders\n• Stretches and tones the front of your neck and your abdominals\n• Stretches and stimulates the organs of your belly and throat\n• Strengthens your upper back and the back of your neck\n• Relieves stress and irritation\n• Improves posture\n• Therapeutic for rounded-shoulders, asthma, spasms in the bronchial tubes, and other respiratory issues"
    },
    {
      "passioID": "1003748",
      "name": "Mayurasana",
      "sanskrit": "मयूरासन",
      "english": "Peacock",
      "type": "Balancing",
      "description": "In this asana the body is raised like a horizontal stick holding the floor with both palms while the body is supported by the elbows.",
      "url": "https://en.wikipedia.org/wiki/Mayurasana",
      "benefits": "• Better Posture: Mayurasana is known for its ability to improve posture and is an excellent remedy for posture-related health issues, particularly those affecting the limbs, spine, and joints.\n• Strengthening Muscles: It is well-known for strengthening the forearms, elbows, thighs, back (spine), chest, and wrist joints by providing a good stretch to the arms and back.\n• Detoxification: Mayurasana detoxifies the body and is claimed to be an excellent treatment for diabetes and piles.\n• Energize Organs: It strengthens the digestive organs such as the stomach, intestines, spleen, liver, pancreas, and kidneys and is believed to enhance and boost blood circulation in the abdominal area. It also stimulates and aids in the correct functioning of the lungs.\n• Helps Reproductive System: It helps the reproductive system by boosting and regulating it. Additionally, it aids in increasing sexual interest and activity.\n• Improves Mental Health: It aids in the relaxation of the mind. As a result, Mayurasana is an excellent treatment for people suffering from a variety of stress and anxiety problems."
    },
    {
      "passioID": "1003749",
      "name": "Natarajasana",
      "sanskrit": "नटराजासन",
      "english": "Nataraja's Pose",
      "type": "Standing",
      "description": "This aesthetic, stretching and balancing asana develops concentration and grace;it is used in the Indian classical dance form Bharatanatyam.The actor Mariel Hemingway describes Natarajasana as \"a beautiful pose with tremendous power\", comparing the balance and tension in the arms and legs with an archery bow, and calling it \"a very difficult pose to hold.\"\nThe pose is entered from standing in Tadasana, bending one knee and stretching that foot back until it can be grasped with the hand on that side. The foot can then be extended back and up, arching the back and stretching out the other arm forwards.For the full pose and a stronger stretch, reverse the rear arm by lifting it over the shoulder, and grasp the foot.",
      "url": "https://en.wikipedia.org/wiki/Natarajasana",
      "benefits": "• This posture can assist in losing weight, as you tend to burn calories during practice.\n• It strengthens and stretches your ankles, legs, thighs, chest, abdomen, thorax, and hips.\n• This pose develops greater flexibility in your spine, shoulders, and hamstrings.\n• Practicing consistently improves your balance.\n• It acts as a great stress buster, calming your mind.\n• It greatly improves your digestive system.\n• You will find your concentration increasing in intensity.\n• A sense of invigoration is felt after practicing this posture, since it activates your entire body."
    },
    {
      "passioID": "1003752",
      "name": "Padmasana",
      "sanskrit": "पद्मासन",
      "english": "Lotus",
      "type": "Sitting",
      "description": "From sitting cross-legged on the floor in Sukhasana, one foot is placed on top of the opposite thigh with its sole facing upward and heel close to the abdomen. The other foot is then placed on the opposite thigh as symmetrically as possible.The pose requires \"very open hips\".It can be modified using a support such as a cushion or blanket; by sitting on its forward edge, the pelvis is tilted forward.",
      "url": "https://en.wikipedia.org/wiki/Lotus_position",
      "benefits": "• Opens up the hips\n• Stretches the ankles and knees\n• Calms the brain\n• Increases awareness and attentiveness\n• Keeps the spine straight\n• Helps develop good posture\n• Eases menstrual discomfort and sciatica\n• Helps keeps joints and ligaments flexible\n• Stimulates the spine, pelvis, abdomen, and bladder\n• Restores energy levels"
    },
    {
      "passioID": "1003754",
      "name": "Parighasana",
      "sanskrit": "परिघासन",
      "english": "Gate",
      "type": "Standing",
      "description": "The pose is entered from an upright kneeling position. One leg is stretched straight out to the side, the arms are stretched out sideways, and the body is extended to the side of the outstretched leg until the arm lies along the leg. The other arm may be stretched up alongside the head, and the hand may eventually lie on top of the other hand and foot.",
      "url": "https://en.wikipedia.org/wiki/Parighasana",
      "benefits": "• One of the most important Parighasana benefits is that it opens up your lungs and promotes better respiration. This is beneficial for people who suffer from COPD or asthma.\n• Since it involves sideways bending, the Gate Pose yoga gives your digestive organs a good stretch and stimulation. When practised regularly, this prevents and cures conditions such as IBS, gas, and constipation.\n• One of the most effective Parighasana benefits is that it stimulates your chest region making your cardiovascular system healthy and free of diseases.\n• One of the most important benefits of Parighasana is that it massages organs such as your pancreas, intestines, stomach, spleen, liver, and kidneys. This keeps your hormonal balance intact and prevents the risk of diseases of these organs.\n• Gate Pose benefits those who suffer from lower back pain and stiffness. By stretching your back, it not just cures these issues but also corrects your posture.\n• Since Parighasana gives your whole body a good stretch, it helps you lose weight. This prevents the risk of obesity-related disorders.\n• Since you don’t need an elaborate set-up for doing this asana, it can easily be included in your home workouts."
    },
    {
      "passioID": "1003758",
      "name": "Parshvottanasana",
      "sanskrit": "पार्श्वोत्तनासन",
      "english": "Intense side stretch",
      "type": "Standing",
      "description": "The pose is entered from Tadasana. The hands are pressed palms together in prayer position behind the back, fingertips upwards. The feet are placed about a leg length apart, both legs remaining straight. The forward foot points directly forwards; the rear foot is turned forwards some 60 degrees. The hips are aligned at right angles to the feet, so that the body can move downwards in a forward bend straight over the front leg.The hands may be taken to the floor to intensify the stretch.",
      "url": "https://en.wikipedia.org/wiki/Parshvottanasana",
      "benefits": "• Stretches your hamstrings.\n• Strengthens your quads.\n• Strengthens your calf muscles in your front leg and stretches them on your back leg.\n• Builds strength in your hip stabilizers including your gluteus medius and minimus.\n• Strengthens your spine.\n• Strengthens your ankles and feet, as they are key to finding your balance in the pose.\n• Helps to build support for your lower back.\n• Builds strength in your upper back.\n• Tones and strengthens your core.\n• If you’re doing the full pose, with Reverse Prayer, it stretches your wrists.\n• If you’re doing the full pose, with Reverse Prayer, Parsvottanasana helps to open your chest and strengthen your shoulders, which helps improve your posture."
    },
    {
      "passioID": "1003760",
      "name": "Pashasana",
      "sanskrit": "पाशासन",
      "english": "Noose",
      "type": "Squatting",
      "description": "In this yoga asana, the human body creates a 'noose' when the practitioner wraps their arms around their squatting legs (from Upaveshasana) with their hands clasped behind their back, while twisting to one side.",
      "url": "https://en.wikipedia.org/wiki/Pasasana",
      "benefits": "• Can relieve asthma\n• Stimulates the abdomen\n• Relieves back, shoulder and neck pain\n• Strengthens thighs, groin, ankles, and knees\n• Strengthens the spine and improves\n• Increases blood circulation in the torso and thus improves the nervous system’s function\n• Improves digestion by squeezing and massaging the internal organs\n• Relieves menstruation discomfort\n• Beneficial to improve adverse effects of sciatica"
    },
    {
      "passioID": "1003763",
      "name": "Paschimottanasana",
      "sanskrit": "पश्चिमोत्तानासन",
      "english": "Seated Forward Bend",
      "type": "Sitting",
      "description": "The pose is entered from Dandasana (the seated Staff Pose) by bending forward from the hips without straining and grasping the feet or lower legs. A strap may be placed around the feet and grasped in the hands if the back is stiff. The head may be rested on a folded blanket or bolster, which may be raised on a small stool if necessary.\nPeople who have difficulty bending their backs should exercise caution when performing this asana.",
      "url": "https://en.wikipedia.org/wiki/Paschimottanasana",
      "benefits": "• Stretches hamstrings and gluteal muscles (butt and outer hips).\n• Strengthen quads, abdominals and knee joints.\n• Stretches calf muscles.\n• Elongates the spine when done with proper alignment (and suitable flexibility in hamstrings).\n• Strengthens the erector spinae muscles.\n• Builds strength in the shoulders.\n• Strengthens biceps, if done with bent arms, and triceps, if done with straight arms.\n• Helps improve flexibility of hips.\n• Students may find release in the upper-, mid- and low- back."
    },
    {
      "passioID": "1003764",
      "name": "Pincha Mayurasana",
      "sanskrit": "पिञ्चमयूरासन",
      "english": "Feathered Peacock",
      "type": "Balancing",
      "description": "Because it requires strength, balance, and flexibility, Vrischikasana is described as an advanced posture:B. K. S. Iyengar's 1966 Light on Yoga grades it as level 32 out of 60.In the basic pose, the body is balanced as in headstand, but the legs are bent and the back is lightly arched, and the head is lifted from the ground so the body is supported only by the forearms.A more advanced variant has the back arched further so the feet touch the top of the head.A second advanced variant has the legs held straight out horizontally above the head and arms, resembling the scorpion's tail stretched in a threat posture forwards over its body.The pose can also be executed in a variant with straight arms.Whether resting on forearms (Pincha Mayurasana) or with arms in handstand, the asana can be worked towards with the use of a chair to support the feet.\nLight on Yoga distinguishes Vrischikasana I (forearm balance, feet on head, plates 536 and 537) and Vrischikasana II (handstand, feet on head, plate 538), describing the second as an \"extremely difficult\" balance. The placing of the feet on the head is stated to indicate an attempt to subjugate the ego with its \"deadly\" scorpionlike emotions.\nIn 2022, the Indian yoga teacher Yash Moradiya held Vrischikasana for 29 minutes and 4 seconds, as measured by Guinness World Records in Dubai.",
      "url": "https://en.wikipedia.org/wiki/Vrischikasana",
      "benefits": "• Strengthens wrists and forearms.\n• Strengthens biceps and triceps.\n• Strengthens shoulders.\n• Strengthens pectoralis major, latissimus dorsi, teres major, serratus anterior, trapezius and triceps.\n• Strengthens scapular stabilisers (serratus anterior, rhomboids, levator scapulae, trapezius).\n• Tones your core muscles (transverse abdominus, rectus abdominus, obliques).\n• Strengthens erector spinae and other back muscles.\n• Strengthens the adductor muscles of your legs (inner thighs).\n• Strengthens hip extensors (gluteus maximus).\n• Improves balance."
    },
    {
      "passioID": "1003766",
      "name": "Prasarita Padottanasana",
      "sanskrit": "प्रसारित पादोत्तानासन",
      "english": "Wide Stance Forward Bend",
      "type": "Standing",
      "description": "This is a standing pose with the feet wide apart and the body folded forward and down until in the completed pose the head touches the ground and the hands are placed flat on the ground, the tips of the fingers in line with the heels, the arms bent at right angles.In Ashtanga vinyasa yoga, four variant forms of the asana, which is considered fundamental to that style of yoga, are identified. A pair of yoga blocks may be placed under the hands to allow those with tight hamstrings to execute the pose without strain.",
      "url": "https://en.wikipedia.org/wiki/Prasarita_Padottanasana",
      "benefits": "• Stretches your hamstrings.\n• Stretches your adductors (inner thighs).\n• Is a hip opener and also involves deep hip flexion.\n• Helps find length and release for your spine and neck.\n• If you can bring your head to the ground, or a stack of blocks, the pose helps calm your mind.\n• Can help release tension in your spine, shoulders and upper back.\n• Strengthens your quadriceps and hip flexors.\n• Strengthens your core.\n• Strengthens your calf muscles and ankle muscles.\n• Your shoulders, chest, abdomen, hips, back, and legs all get a stretch during the practice of coming into and out of this pose, which helps increase the range of motion for all of these areas, leading to more flexibility.\n• Ashtanga Yoga links the four variations in a flow which is said to improve strength, balance, and flexibility."
    },
    {
      "passioID": "1003768",
      "name": "Shalabhasana",
      "sanskrit": "शलभासन",
      "english": "Locust",
      "type": "Reclining",
      "description": "Salabhasana is entered from a prone position. The legs are stretched out straight and lifted; the arms are stretched straight back, palms down, and lifted; the head is lifted and the gaze is directed straight ahead. It is a back bend, or spine stretch, utilizing the strength of the upper and middle back to lift the weight of the legs as high as possible from a starting position while face down on the floor. It improves flexibility and coordination, exercises the back muscles, and increases strength and stamina.",
      "url": "https://en.wikipedia.org/wiki/Salabhasana",
      "benefits": "• Salabhasana yoga pose strengthens the muscles of the body. Salabhasana pose works on and strengthens the spine, arms, buttocks, thighs, legs, and calves.\n• Salabhasana pose is a good pose to practice stretching in the shoulders, chest, belly, thighs, abdominal organs, and back muscles.\n• Practising locust pose ensures healthy stretching of the nerves and improves the blood circulation resulting in the circulation of newly oxygenated blood.\n• Salabhasana Locust pose boosts the function of the nervous system and enhances its activity. Salabhasana Locust pose stimulates the entire autonomic nervous system, especially the parasympathetic part of it.\n• Practising locust pose causes suitable massage of the abdominal organs and may help the practitioners in overcoming many diseases and disorders while boosting healthy digestive function and relieving gastric trouble and flatulence.\n• Practising shalabhasana exerts adequate pressure in the abdominal region of the body. This can transmit to some vital organs of the body such as the lungs and the heart, enhancing the efficiency of these organs.\n• Practising shalabhasana pose causes adequate stretching of the spine and may therefore be beneficial for the sacral as well as the lumbar region of the spine.\n• Practising shalabhasana also benefits the bladder and the prostate gland.\n• Practising shalabhasana may help in burning fat and aiding fat loss.\n• Practising locust pose can be helpful in rectifying neck pain, strengthening the neck muscles, and repairing the defects in the neck joints.\n• Practising salabhasana locust pose may help cure problems related to menstruation."
    },
    {
      "passioID": "1003767",
      "name": "Sarvangasana",
      "sanskrit": "सालम्बसर्वाङ्गासन",
      "english": "Shoulder Stand",
      "type": "Inversion",
      "description": "Shoulderstand is entered from a supine position with the knees bent. The shoulders may be supported on folded blankets, and the upper arms may be held in with a belt just above the elbows. Beginners may lift with bent legs, advanced users with straight legs. The back is supported by the hands: once up, the hands reach lower down the trunk towards the head, and the trunk is lifted further; the legs may then be straightened to a vertical position.",
      "url": "https://en.wikipedia.org/wiki/Sarvangasana",
      "benefits": "• Strengthens your shoulder and neck muscles.\n• Helps open your shoulders.\n• When done with alignment, it helps build strength in your legs.\n• The action of holding your whole body up builds strength in your core and your whole torso."
    },
    {
      "passioID": "1003765",
      "name": "Shavasana",
      "sanskrit": "शवासन",
      "english": "Corpse",
      "type": "Reclining",
      "description": "Shavasana and some sitting asanas maintain the balance between relaxation and meditation (two key components of yoga) by their equal input of physical stimuli.\nShavasana is performed on the back with the legs spread as wide as the yoga mat and arms relaxed to both the sides of the body, and the eyes closed. The whole body is relaxed on the floor with an awareness of the chest and abdomen rising and falling with each breath. During Shavasana, all parts of the body are scanned for muscular tension of any kind. Any muscular tension the body finds is consciously released as it is found. All control of the breath, the mind, and the body is then released for the duration of the asana. Shavasana is typically practiced for 5–10 minutes at the end of an asana practice, but can be practiced for 20–30 minutes.In Sivananda yoga, it is practised not only for \"Final Relaxation\" at the end of a session, but before the session and between asanas.\nThe asana is released by slowly deepening the breath, flexing the fingers and toes, reaching the arms above the head, stretching the whole body, and exhaling while bringing the knees to the chest and rolling over to the side in a fetal position, drawing the head in the right arm. From here, one can push up into a seated position. Drowsiness or restlessness of the mind while in Shavasana may be counteracted by increasing the rate and depth of breathing. While in Shavasana, it is important to be in a neutral position.",
      "url": "https://en.wikipedia.org/wiki/Shavasana",
      "benefits": "• One study, “suggests that a person practicing Shavasana can successfully reduce the physiological effects of stress”.\n• Savasana and Yoga Nidra can help steady the heart rate of patients with insomnia.\nA small study (only 25 patients) showed a decrease in hypertension after six months of “Shavasana therapy”.\n• There are also studies showing improvement in health of patients with diabetes. However is is worth noting that these studies did not prove Savasana can cure diabetes, as is often claimed.\n• Reduces fatigue.\n• Reduces stress."
    },
    {
      "passioID": "1003762",
      "name": "Setu Bandha Sarvangasana",
      "sanskrit": "सेतुबन्धसर्वाङ्गासन",
      "english": "Shoulder supported bridge",
      "type": "Inversion",
      "description": "The pose is entered from Sarvāṅgāsana (shoulderstand), the chest being held forwards by the hands and the feet lowered to the ground behind the back, the knees remaining bent; or more easily, by lifting the back from lying supine on the ground. The full pose has the knees bent and the ankles caught (Bandha) by the hands. The pose may be exited either by lying down or by jumping back up into shoulderstand.",
      "url": "https://en.wikipedia.org/wiki/Setu_Bandha_Sarvangasana",
      "benefits": "• Strengthens your hamstrings and strengthens your quadriceps.\n• Strengthens your main back muscles — the erector spinae.\n• Stretches your hip flexors, especially your psoas and iliacus.\n• Builds strength in your pelvic floor muscles.\n• Stretches chest / pectoralis major.\n• Strengthens transverse abdominus and rectus abdominus.\n• Strengthens your glutes and leg adductors.\n• Improves the flexibility of your spine.\n• Strengthens your latissimus dorsi, pectoralis minor, trapezius, and serratus anterior muscles, helping build strong shoulders.\n• Strengthens your triceps.\n• Can be beneficial if your have sciatica. See Modifications below.\n• Strengthens ankles.\n• Strengthens support muscles of your neck, which can reduce strain around your neck.\nBuilds strength in the support muscles of your knees"
    },
    {
      "passioID": "1003761",
      "name": "Simhasana",
      "sanskrit": "सिंहासन",
      "english": "Lion",
      "type": "Sitting",
      "description": "The practitioner kneels with the buttocks on the inner arches of the feet, stretches the arms forwards with the hands outspread just off the ground, and makes a facial expression with the mouth open wide and the tongue out to resemble a lion. The yoga guru B. K. S. Iyengar notes that this is the traditional pose; he calls it Simhasana.",
      "url": "https://en.wikipedia.org/wiki/Simhasana",
      "benefits": "• The best exercise for face, eyes, tongue and throat.\n• Clears the Vocal cords.\n• Simhasana properly opens the Respiratory tract.\n• Strengthens Fingers and hands.\n• Prevents soreness of the throat.\n• Useful for tonsils, thyroid and other problems related to throat.\n• Beneficial in unclear pronunciation and in ear problems.\n• Best pose for those children who lisp.\n• It cures bad breath.\n• The Lion Pose is Helpful for improving the tone of the voice.\n• Give relief in back pain."
    },
    {
      "passioID": "1003759",
      "name": "Shirshasana",
      "sanskrit": "शीर्षासन",
      "english": "Headstand",
      "type": "Inversion",
      "description": "In the Supported Headstand (Salamba Shirshasana), the body is completely inverted, and held upright supported by the forearms and the crown of the head. In his Light on Yoga, B. K. S. Iyengar uses a forearm support, with the fingers interlocked around the head, for the basic posture Shirshasana I and its variations; he demonstrates a Western-style tripod headstand, the palms of the hands on the ground with raised elbows, for Shirshasana II and III; and other supports for further variants. Iyengar names and illustrates ten variants in all, as well as several preparatory and transitional poses.\nThe yoga headstand is nicknamed \"king\" of all the asanas.A variety of other asanas can be used to build the required upper body strength and balance.\nShirshasana, alongside Sarvangasana and Padmasana, is one of the asanas most often reported as the cause of an injury.",
      "url": "https://en.wikipedia.org/wiki/Shirshasana",
      "benefits": "• Strengthens the supporting muscles of your spine, shoulders and neck.\n• Improves overall balance.\n• Tones abdominal muscles (aka your core).\n• Strengthens your erector spinae (back) and shoulders.\n• Strengthens your legs — primarily your quads and adductors adductors.\n• Clears sinuses in some students.\n• Can relieve headaches in some students.\n• Is reported to relieve some neck injuries and realign the vertebral column."
    },
    {
      "passioID": "1003757",
      "name": "Sukhasana",
      "sanskrit": "सुखासन",
      "english": "Easy",
      "type": "Sitting",
      "description": "While opening the hips and lengthening the spine, the asana's relative ease on the knees makes it easier than siddhasana or padmasana for people with physical difficulties. Some schools do not consider it to be as effective for prolonged meditation sessions because it is easy to slump forward while sitting in it. For meditation, it is important that the spine be straight and aligned with the head and neck. But if the practitioner steadies the sukhasana pose by putting pillows or blankets under the knees to create a steadiness, it may be easier to sit longer in sukhasana for meditation without slumping forward. An additional blanket or pillow under the buttocks may also be beneficial and steadying.The 20th century Jnana Yoga guru Ramana Maharshi advocated it as suitable for attaining Enlightenment.",
      "url": "https://en.wikipedia.org/wiki/Sukhasana",
      "benefits": "• Helps to improve concentration.\n• Helps the spine to align itself due to which the shoulders come into a proper position naturally and hence provides you with a good posture.\n• Helps in reducing stress and anxiety.\n• It is good for the body's stability, strength and mobility and also helps to strengthen the lower half.\n• It has a relaxing effect on the mind and body which is helpful in reducing stress and anxiety.\n• Improves focus and automatically makes you more attentive.\n• It strengthens the back muscles and improves the overall body posture.\n• Lengthens the spine and back muscles.\n• Enables the blood flow towards the stomach and felicitates better digestion and assimilation of the nutrients.\n• Stretches the external part of the knees which becomes stiff after sitting for long hours.\n• Helps to broaden the chest and collar bones.\n• Improves blood circulating.\n• Helps in weight loss if practiced while eating food.\n• Helps to improve one's sense of mind.\n• Helps to grow height in kids.\n• Is helpful for people with stiff or rigid body type. "
    },
    {
      "passioID": "1003756",
      "name": "Supta Padangusthasana",
      "sanskrit": "सुप्त पादाङ्गुष्ठासन",
      "english": "Big toe supine",
      "type": "Reclining",
      "description": "The pose is entered by lying down on one's back, raising one leg and grasping the big toe with the hand on the same side. The opposite leg is stretched straight out on the ground, and the opposite hand rests on the top of the thigh. A variant is to turn the leg outwards and allow it to sink towards the ground, keeping the hip and trunk level. Another variant, possible only with supple hamstrings, is to bring the raised leg forwards over the face, raising the head to touch the leg, and stretching the arm that is grasping the big toe back and up over the shoulder.",
      "url": "https://en.wikipedia.org/wiki/Supta_Padangusthasana",
      "benefits": "• Builds strength in the arches of your feet which helps “fix” flat feet.\n• Strengthens your quadriceps.\n• Stretches your hamstrings.\n• Strengthens your calf muscles.\n• Strengthens your erector spinae.\n• Stretches your gluteus maximus.\n• Strengthens the adductors of your legs and hips.\n• Elongates your spine.\n• Strengthens your hip flexors.\n• Strengthens your abdominal muscles.\n• Strengthens your knee joints.\n• Helps improves hip flexibility.\n• Can help to improve overall balance.\n• Can help relieve tension in the neck.\n• Can help stretch your lower back.\n• Your Piriformis muscles are stretched which can help relieve SI joint pain (aka sciatica)."
    },
    {
      "passioID": "1003755",
      "name": "Surya Namaskar",
      "sanskrit": "सुर्य नमस्कार",
      "english": "Salute to the Sun",
      "type": "Standing",
      "description": "Sun Salutation is a sequence of around twelve yoga asanas connected by jumping or stretching movements, varying somewhat between schools. In Iyengar Yoga, the basic sequence is Tadasana, Urdhva Hastasana, Uttanasana, Uttanasana with head up, Adho Mukha Svanasana (Downward Dog), Urdhva Mukha Svanasana (Upward Dog), Chaturanga Dandasana, and then reversing the sequence to return to Tadasana; other poses can be inserted into the sequence.\nIn Ashtanga Vinyasa Yoga, there are two Sun Salutation sequences, types A and B.The type A sequence of asanas is Pranamasana, Urdhva Hastasana, Uttanasana, Phalakasana (high plank), Chaturanga Dandasana, Urdhva Mukha Svanasana, Adho Mukha Svanasana, Uttanasana and back to Pranamasana.The type B sequence of asanas (differences marked in italics) is Pranamasana, Utkatasana, Uttanasana, Ardha Uttanasana, Phalakasana, Chaturanga Dandasana, Urdhva Mukha Svanasana, Adho Mukha Svanasana, Virabhadrasana I, repeat from Phalakasana onwards with Virabhadrasana I on the other side, then repeat Phalakasana through to Adho Mukha Svanasana (a third time), Ardha Uttanasana, Uttanasana, Utkatasana, and back to Pranamasana.",
      "url": "https://en.wikipedia.org/wiki/Sun_Salutation",
      "benefits": "• It stretches, tones and strengthens your muscles, ligaments, joints.\n• It helps improve overall flexibility in your spine, hamstrings, shoulders, and more.\n• It also strengthens the muscles that support your spine.\n• It prepares you for more complicated asanas.\n• The repetition of these fairly simple poses helps to calm your mind.\n• Helps stretch and strengthen almost all of your body, including arms, abs, thighs, butt, spine, neck, shoulder, hands, wrists, and back.\n• It helps improves your posture.\n• If practiced repetitively and quickly it will raise your heart rate – increased cardiovascular activity strengthens your heart and can help prevent heart disease."
    },
    {
      "passioID": "1003753",
      "name": "Tadasana",
      "sanskrit": "ताडासन",
      "english": "Mountain",
      "type": "Standing",
      "description": "Tadasana is the basic standing asana on which many other poses are founded. The feet are together and the hands are at the sides of the body. The posture is entered by standing with the feet together, grounding evenly through the feet and lifting up through the crown of the head. The thighs are lifted, the waist is lifted, and the spine is elongated. The breathing is relaxed. It is used in some schools of yoga in between other poses, to allow the body and consciousness to integrate the experience of the preceding asana and to prepare for the next.\nAsanas that help prepare for Tadasana include Adho Mukha Svanasana and Uttanasana.",
      "url": "https://en.wikipedia.org/wiki/Tadasana",
      "benefits": "• Strengthens legs.\n• Helps strengthen your pelvic floor.\n• Strengthens biceps and triceps.\n• Helps create stability in the shoulder joints.\n• Tones abdomen and hips.\n• Strengthens the posterior chain (back muscles, butt, hamstrings).\n• Helps improve balance.\n• Helps correct posture.\n• Can help relieve sciatica discomfort."
    },
    {
      "passioID": "1003750",
      "name": "Tittibhasana",
      "sanskrit": "टिट्टिभासन",
      "english": "Firefly",
      "type": "Balancing",
      "description": "Tittibhasana is described in Light on Yoga as being entered from Dvi Pada Sirsasana, a difficult sitting pose with the legs crossed behind the head, that in B. K. S. Iyengar's words \"requires practice\", by uncrossing the ankles, stretching the legs straight up, and pushing down on the hands to balance. It is an intermediate level asana in Ashtanga vinyasa yoga.\nThe pose is said to activate the manipura chakra at the solar plexus.",
      "url": "https://en.wikipedia.org/wiki/Tittibhasana",
      "benefits": "• Tittibhasana (Firefly Pose) Makes your wrist stronger along with improves the strength of the arms.\n• It tightens and tones the area of the belly.\n• Stretches your back torso, inner groins, and hamstrings.\n• The Yoga pose also helps in bringing an overall sense of balance and improves core strength.\n• Firefly Pose gives the back torso and inner groins a good stretch.\n• Tittibhasana Good for your mind.\n• Improves digestion."
    },
    {
      "passioID": "1003747",
      "name": "Trikonasana",
      "sanskrit": "त्रिकोणासन",
      "english": "Triangle",
      "type": "Standing",
      "description": "Trikonasana is performed in two parts, facing left, and then facing right. The practitioner begins standing with the feet one leg-length apart, knees unbent, turns the right foot completely to the outside and the left foot less than 45 degrees to the inside, keeping the heels in line with the hips. The arms are spread out to the sides, parallel to the ground, palms facing down; the trunk is extended as far as is comfortable to the right, while the arms remain parallel to the floor. Once the trunk is fully extended to the right, the right arm is dropped so that the right hand reaches the shin (or a block or on the floor)to the front (left side) of the right foot, with the palm down if flexed. The left arm is extended vertically, and the spine and trunk are gently twisted counterclockwise (i.e., upwards to the left, since they're roughly parallel to the floor), using the extended arms as a lever, while the spine remains parallel to the ground. The arms are stretched away from one another, and the head may be turned to gaze at the left thumb, slightly intensifying the spinal twist. Returning to standing, the pose is repeated to the left.",
      "url": "https://en.wikipedia.org/wiki/Trikonasana",
      "benefits": "• Hip opening.\n• Strengthens quads.\n• Stretches hamstrings.\n• Strengthens ankles, and calf muscles.\n• Increases lateral flexibility of the spine.\n• Opens chest.\n• Strengthens triceps."
    },
    {
      "passioID": "1003751",
      "name": "Tulasana",
      "sanskrit": "तुलासन",
      "english": "Balance / Scales",
      "type": "Balancing",
      "description": "From Padmasana (lotus position), the practitioner with the palms placed on the floor either side of the hips raises the entire torso and crossed legs using the arms and shoulders.",
      "url": "https://en.wikipedia.org/wiki/Tulasana",
      "benefits": "• Just like the Dolasana yoga pose, Tulasana also enhances your overall body strength. It works on the muscles in your shoulders, hands, core, and arms and improves your workout performance and endurance.\n• One of the most important Tolasana benefits is that since it gives a deep stretch to your shoulders, arms, hips, legs, and wrists, it makes them more flexible. Just like in Dolasana, this asana also improves your flexibility and makes daily activities easier.\n• Tolasana benefits people who suffer from chronic lower back pain or stiffness due to their sedentary lifestyle. It strengthens your lower back and makes it more flexible and cures postural problems.\n• One of the most important benefits of Tulasana is that it enhances your circulation. This helps in calming your mind and relieving your stress and anxiety. It also facilitates mental health and prevents neurodegenerative problems like Alzheimer and Parkinson’s.\n• Tulasana benefits people who experience chronic digestive problems like IBS, gas, and constipation. It stimulates your digestive organs and improves their functioning.\n• One of the most important benefits of Tulasana is that it reinvigorates your root, sacral, and solar plexus chakras. This lifts your mood, energises you, and enhances your creativity and self-confidence.\n• Since you don’t need to invest in expensive equipment or yoga studio memberships, this asana can be easily included in your home workouts."
    },
    {
      "passioID": "1003745",
      "name": "Upavishta Konasana",
      "sanskrit": "उपविष्टकोणासन",
      "english": "Open Angle",
      "type": "Sitting",
      "description": "The pose may be entered from dandasana (staff pose) by moving the legs apart as far as possible. The big toes may then be grasped with the hands, or with a belt around each foot. The back is lightly arched by raising the coccyx, and the body is inclined forwards.In the completed pose, the body leans forwards until the chin and nose touch the ground.People who cannot sit on the floor in dandasana can sit on a folded blanket for the pose.",
      "url": "https://en.wikipedia.org/wiki/Upavi%E1%B9%A3%E1%B9%ADa_Ko%E1%B9%87%C4%81sana",
      "benefits": "• Stretches your hamstrings, pectineus and inner thighs (adductors).\n• Strengthens your erector spinae, which can help improve your posture.\n• Strengthens your other core muscles as well (transverse abdominus, rectus abdominus, pelvic floor, obliques).\n• Strengthens your hips’ external rotators (the deep six muscles plus the gluteus maximus, medius and minimus).\n• Stretches and strengthens your hips.\n• Opens your hips, helping to increase hip mobility.\n• Strengthens your lower back.\n• Strengthens your shoulders.\n• Strengthens your hip flexors (iliopsoas, rectus femoris, tensor fastiae latae, etc).\n• Strengthens your pelvic floor.\n• May help alleviate sciatica symptoms."
    },
    {
      "passioID": "1003740",
      "name": "Chakrasana",
      "sanskrit": " चक्रासन",
      "english": "\nWheel",
      "type": "Inversion",
      "description": "In the general form of the asana, the practitioner has hands and feet on the floor, and the abdomen arches up toward the sky. It may be entered from a supine position or through a less rigorous supine backbend, such as Setu Bandha Sarvangasana (Bridge Pose). Some advanced practitioners can move into Wheel Pose by \"dropping back\" from Tadasana (Mountain Pose), or by standing with the back to a wall, reaching arms overhead and walking hands down the wall toward the floor. Advanced practitioners may also follow wheel with any of its variations (listed below), or with other backbends, such as Dwi Pada Viparita Dandasana, or by pushing back up to stand in Tadasana.\nPreparatory poses are backbends such as Salabhasana (Locust), variants of Bhujangasana (Cobra, Sphinx), and Dhanurasana (Bow).\nCounter poses are forward bends including Paschimottanasana (Seated Forward Bend) and Balasana (Child's Pose).",
      "url": "https://en.wikipedia.org/wiki/Chakrasana",
      "benefits": "• Strengthens liver, pancreas and kidneys.\n• Excellent for heart.\n• Good for infertility, asthma and osteoporosis.\n• Strengthens arms, shoulders, hands, wrists and legs.\n• Stretches the chest and lungs.\n• Strengthens the arms and wrists, legs, buttocks, abdomen, and spine.\n• Stimulates the thyroid and pituitary glands.\n• Increases energy and counteracts depression.\n• This asana also gives strength to your legs, abdomen, buttocks, spine, shoulder blades, glutes, hamstrings, lower back, wrists, and arms.\n• It cures infertility, asthma, and osteoporosis.\n• It also relieves stress and reduces depression, and makes you feel energetic and full of life."
    },
    {
      "passioID": "1003737",
      "name": "Urdhva Mukha Shvanasana",
      "sanskrit": "ऊर्ध्वमुखश्वानासन",
      "english": "Upward-Facing Dog",
      "type": "Reclining",
      "description": "The pose is entered with an inhalation from a prone position (or from a pose such as Chaturanga Dandasana or Ashtanga Namaskara in a Surya Namaskar cycle), taking the feet a little apart. The legs are stretched out straight, the toes out (not tucked under), and the weight of the body is supported on the hands with outstretched arms so the hips are off the ground. The gaze is directed straight upwards, so the neck and back are arched.",
      "url": "https://en.wikipedia.org/wiki/Urdhva_Mukha_Shvanasana",
      "benefits": "• Strengthens triceps.\n• Stretches abdomen.\n• Strengthens posterior deltoid and stretches anterior deltoid.\n• Strengthens back muscles, particularly the erector spinae, which take your spine into a back bend. Also strengthens the trapezius and rhomboids.\n• Strengthens quads, which straighten your knee joints.\n• Stretches the front of your ankles.\n• Strengthens hip extensors (gluteus maximus and hamstrings).\n• Strengthens adductors (inner thighs).\n• Stretches wrist flexors and strengthens wrist extensors.\n• When performed with alignment, it can help alleviate sciatica pain."
    },
    {
      "passioID": "1003734",
      "name": "Ushtrasana",
      "sanskrit": "उष्ट्रासन",
      "english": "Camel",
      "type": "Kneeling",
      "description": "Ustrasana is a deep backward bend from a kneeling position; the completed pose has the hands on the heels.The backs of the feet may be flat on the floor, or the toes may be tucked under for a slightly less strong backbend.\nThe pose is one of the 26 asanas in the Bikram Yoga sequence.",
      "url": "https://en.wikipedia.org/wiki/Ustrasana",
      "benefits": "• Helps with mobility in the shoulders and upper back.\n• Stretches the front of the body.\n• Strengthens the legs and back.\n• Strengthens erector spinae (back extensors).\n• Stretches the chest.\n• Opens up the hips, stretches hip flexors.\n• Strengthens arms.\n• When done with proper engagement, will help tone deep core muscles."
    },
    {
      "passioID": "1003732",
      "name": "Utkatasana",
      "sanskrit": "उत्कटासन",
      "english": "Awkward or Powerful",
      "type": "Standing",
      "description": "In Utkatasana, the knees are hips-width apart and bent. The hips are back, and the chest is forward. Both arms are above the head, in line with the ears.The spine is elongated, and the sternum is lifted.This pose is shaped like a lightning bolt and is said to be powerful and stimulating.",
      "url": "https://en.wikipedia.org/wiki/Utkatasana",
      "benefits": "• Lifting your torso and arms builds strength in arms, shoulders, and back.\n• Strengthens the lower body while stretching the upper back.\n• Strengthens biceps and triceps.\n• Helps open and create strength and stability in the shoulder joints.\n• Tones abdomen and outer hips (gluteus medius and minimus).\n• Strengthens inner thighs (adductor muscles).\n• Strengthens the posterior chain (back muscles, butt, hamstrings).\n• Strengthens hip flexors.\n• Strengthens the quadriceps.\n• Strengthens and stretches gluteus maximus.\n• Stretches calf muscles.\n• Builds strength for the muscles that support the knee.\n• Engages the deep core muscles."
    },
    {
      "passioID": "1003730",
      "name": "Uttanasana",
      "sanskrit": "उत्तानासन",
      "english": "Standing Forward Bend",
      "type": "Standing",
      "description": "The pose is entered from the standing position of Tadasana, bending forward at the hips until the palms can be placed on the floor, ultimately behind the heels.",
      "url": "https://en.wikipedia.org/wiki/Uttanasana",
      "benefits": "• Stretches hamstrings, calves and gluteal muscles.\n• Strengthens quads, hip flexors, abdominals and knee joints.\n• May help lower high blood pressure.\n• Elongates the spine when done with proper alignment.\n• Helps improve flexibility of hips.\n• Helps to strengthen ankle joints.\n• Can help to improve overall balance.\n• Students can find release in the upper-, mid- and lower- back when practicing Uttanasana with proper alignment.\n• Can help relieve tension the the neck."
    },
    {
      "passioID": "1003727",
      "name": "Utthita Hastapadangusthasana",
      "sanskrit": "उत्थित हस्तपादाङ्गुष्ठासन",
      "english": "Standing Big Toe Hold",
      "type": "Standing",
      "description": "Utthita Padangusthasana is a pose with the body standing straight, on one leg; the other leg is stretched out straight, and the foot of the raised leg is grasped by the hand on the same side of the body. It is entered from the standing pose Tadasana.The pose has two forms: I, with the raised leg to the front, and the opposite hand to the hip; II, with the raised leg to the side, and the opposite hand stretched out straight to the other side.Students can practise the pose using a strap to hold the extended foot, or a ledge or wall for support or may keep the knee bent.The pose is at the start of the Primary Series of Ashtanga vinyasa yoga.",
      "url": "https://en.wikipedia.org/wiki/Utthita_Padangusthasana",
      "benefits": "• Stretches your hamstrings.\n• Strengthens your quads.\n• Strengthens your hamstrings.\n• Strengthens your calf muscles.\n• Strengthens your anterior tibialis (front of shin).\n• Strengthens gluteus minimus, medius and maximus.\n• Stretches adductors of lifted leg (inner thigh).\n• Strengthens adductors of standing leg.\n• Strengthens your erector spinae which helps stretch your spine.\n• Strengthens pectoralis minor, lower trapezius and latissimus dorsi (shoulder depressors).\n• Strengthens biceps and triceps.\n• Helps build core strength (including deep core) which improves balance.\n• Can help improve awareness of where your body is in space (proprioception).\n• Demands you build your focus and concentration.\n• Strengthens your psoas muscles.\n• Strengthens your ankles and knees.\n• Strengthens posterior and lateral deltoids while stretching anterior deltoid.\n• Opens your chest and shoulders."
    },
    {
      "passioID": "1003726",
      "name": "Vajrasana",
      "sanskrit": "वज्रासन",
      "english": "Thunderbolt",
      "type": "Kneeling",
      "description": "The practitioner sits on the heels with the calves beneath the thighs. There is a four finger gap between the kneecaps, and the first toe of both the feet touch each other and sit erect.",
      "url": "https://en.wikipedia.org/wiki/Vajrasana_(yoga)",
      "benefits": "• Stretches the top of the feet.\n• Stretches the shin muscles.\n• Helps to strengthen the arches of the feet.\n• Stretches the quads/thighs."
    },
    {
      "passioID": "1003723",
      "name": "Vasishtasana",
      "sanskrit": "वसिष्ठासन",
      "english": "Vasishta's pose",
      "type": "Balancing",
      "description": "The pose is a balancing posture with the body, both legs, and both arms straight, the body on one side. The upper arm is raised as high as possible. The upper leg may be rested on the lower leg, or for the full pose (sometimes called Eka Pada Vasisthasana, One-legged Side Plank) may be raised as high as possible;the upper hand may grasp the foot (sometimes called Vasisthasana B), and the gaze may be directed to the upper hand.",
      "url": "https://en.wikipedia.org/wiki/Utthita_Vasisthasana",
      "benefits": "• Strengthens and tones your arms and shoulders.\n• Tests — and therefore builds — your balance, which helps improve focus and concentration.\n• Strengthens your back muscles, especially your lower back and your deep spinal stabilizing muscle, the quadratus lumborum.\n• Improves your core strength.\n• Stretches and strengthens your wrists.\n• Stretches hamstrings and adductors when top leg is extended up.\n• Builds strength in your gluteus maximus, hamstrings, quadriceps, and calves.\n• Helps you build endurance and focus for more challenging poses.\n• One of the best ways to target and strengthen your obliques.\n• Reduces your risk of a back injury by strengthening your core. A 2016 study found that poor core endurance was linked to increased injury risk."
    },
    {
      "passioID": "1003721",
      "name": "Viparita Karani",
      "sanskrit": "विपरीतकरणि",
      "english": "Legs up the wall",
      "type": "Inversion",
      "description": "Viparita Karani can be any practice where one is upside down. This can include the asanas of shoulder stand (Sarvangasana), headstand (Sirsasana), or handstand (Adho Mukha Vrksasana). In the Hatha Yoga Pradipika, as in most classical texts on haṭha yoga, Viparita Karani is listed as a mudra,meaning its purpose is for the directing of energy upwards within the body, using gravity's action on the inverted body, as opposed to asanas which are used in the Hatha Yoga Pradipika to create steadiness.\nIn one popular expression of Viparita Karani as an asana in modern postural yoga, it resembles Salamba Sarvāngāsana (supported shoulder stand) but with extension in the thoracic spine (rather than the cervical spine, elbows on the floor and hands supporting hips or lower back.",
      "url": "https://en.wikipedia.org/wiki/Viparita_Karani",
      "benefits": "• Allows your muscles to relax.\n• Can help calm the nervous system, which may help relieve anxiety.\n• May help relieve fatigue.\n• The position allows many to relax deeply, which releases tension and stress.\n• A great passive pose to help lengthen your hamstrings.\n• Passive chest opener.\n• Relieves tired legs and feet (after a run, flight, long walk/hike, bike ride, etc.).\n• Stretches glutes, hamstrings, and, if legs are apart, hip adductors."
    },
    {
      "passioID": "1003769",
      "name": "Virabhadrasana",
      "sanskrit": "वीरभद्रासन",
      "english": "Warrior ",
      "type": "Standing",
      "description": "The poses can be entered from a standing position, Tadasana, jumping or stepping the feet wide apart. For Virabhadrasana I, the hips are turned to face the front foot, which is turned fully outwards; the back foot is turned halfway inwards. The body sinks down into a lunge until the front knee is bent to a right angle, the back leg remaining straight, and the back foot working to keep the whole of the sole of the foot on the floor. The arms are stretched straight upwards, the back is slightly arched, and the gaze is directed upwards.",
      "url": "https://en.wikipedia.org/wiki/Virabhadrasana",
      "benefits": "• Lifting your torso and arms helps build strength in arms, shoulders, and back.\n• Strengthens biceps and triceps.\n• Helps open and create strength and stability in the shoulder joints.\n• Tones abdomen and outer hips.\n• Strengthens the posterior chain (back muscles, butt, hamstrings).\n• Helps improve balance.\n• Opens the hip flexors and strengthens the hip extensors.\n• Stretches the psoas muscles.\n• Strengthens the quadriceps, gluteus maximus, calf muscles, and hamstrings.\n• Stretches quadriceps, gluteus maximus, and calf muscles.\n• Builds strength for the muscles that support the knee.\n• Engages the deep core muscles, which helps create stability and improve balance.\n• Can help alleviate pain cause by sciatica."
    },
    {
      "passioID": "1003717",
      "name": "Virasana",
      "sanskrit": "वीरासन",
      "english": "Hero",
      "type": "Kneeling",
      "description": "Virasana is a basic kneeling asana and the starting position for several forward and backwards bends and certain twists. Virasana may also be used as an alternative to other seated asanas such as the padmasana (lotus pose) for meditation. The pose is entered by kneeling down with the knees together, and separating the feet so that the buttocks can rest on the floor. Beginners may instead place one foot on top of the other and sit on them, or may place a cushion between the feet and sit on that to practice. The pose is one of the few that may be performed straight after eating.\nVirasana places the knees at risk of injury if hip extension and rotation are inadequate, in which case the pose requires support under the buttocks to allow the hips to extend. The pose should be avoided if there is any existing knee injury.",
      "url": "https://en.wikipedia.org/wiki/Virasana",
      "benefits": "• This asana helps stretch the ankles, knees, and thighs. This helps in relieving muscle pain and stiffness.\n• It improves the digestion process and relieves you of gas and flatulence.\n• Virasana makes the arches of the feet stronger.\n• It eases the discomforting symptoms of menopause like bloating, stomach pain, and mood swings, etc.\n• This is a great asana for improving circulation in the legs and back. This helps in relieving tired legs and overall fatigue.\n• Practicing this asana regularly helps athletes in improving their endurance and performance in sports.\n• This is a great asana for improving posture, especially for people who need to sit for long hours.\n• It helps to eliminate the swelling in the legs that comes with pregnancy.\n• This is a great yoga pose for curing high blood pressure.\n• Virasana helps in improving the functioning of the lungs and curing asthma and shortness of breath.\n• This is an important asana to help relieve flat feet.\n• Practicing meditation, yoga Nidra, and pranayama along with this asana helps in calming the mind and reducing stress and anxiety. This helps in clearing your thinking,  improving productivity, and preventing several diseases like heart issues, type-2 diabetes, hypertension, etc.\n• This is a very effective kid's yoga pose that helps in improving their endurance, circulation, concentration, and performance in sports.\n• This is a great asana to perform before Surya Namaskar yoga steps as a complete and well-rounded routine that includes both standing and sitting poses to strengthen your leg muscles. It acts as an effective stretching exercise.\n• This is a great asana to help improve your range of motion and lets you perform activities like walking, cycling, running, etc."
    },
    {
      "passioID": "1003713",
      "name": "Vrikshasana",
      "sanskrit": "वृक्षासन",
      "english": "Tree",
      "type": "Standing, Balancing",
      "description": "From Tadasana, weight is shifted to one leg, for example, starting with the left leg. The entire sole of the foot remains in contact with the floor. The right knee is bent and the right foot placed on the left inner thigh, or in half lotus position. In either foot placement, the hips should be open, with the bent knee pointing towards the side. With the toes of the right foot pointing directly down, the left foot, center of the pelvis, shoulders and head are all vertically aligned. Hands are typically held above the head either pointed directly upwards and unclasped, or clasped together in anjali mudra. The asana is typically held for 20 to 60 seconds, returning to tadasana while exhaling, then repeating standing on the opposite leg.",
      "url": "https://en.wikipedia.org/wiki/Vriksasana",
      "benefits": "• Strengthens your legs — knees, quads, hamstrings and hip stabilizers!\n• Opens your hips and stretches your inner thighs and groin muscles.\n• Strengthens your core which helps develop stability.\n• Stretching your arms upwards improves/maintains shoulder flexibility.\n• Strengthens your feet and ankles.\n• Strengthens the muscles of your hips, which helps build stability.\n• Tones and strengthens your arms.\n• Prepares you for other hip-opening poses like Ardha Padma Vrksasana (Half-Lotus Tree Pose) and Eka Pada Rajakapotasana (One-Legged King Pigeon Pose).\n• The focus and concentration you build working on Tree Pose can help your confidence in other one-legged balancing poses."
    },
    {
      "passioID": "1003712",
      "name": "Vrischikasana",
      "sanskrit": "वृश्चिकासन",
      "english": "Scorpion",
      "type": "Inversion",
      "description": "Because it requires strength, balance, and flexibility, Vrischikasana is described as an advanced posture: B. K. S. Iyengar's 1966 Light on Yoga grades it as level 32 out of 60.In the basic pose, the body is balanced as in headstand, but the legs are bent and the back is lightly arched, and the head is lifted from the ground so the body is supported only by the forearms.A more advanced variant has the back arched further so the feet touch the top of the head.A second advanced variant has the legs held straight out horizontally above the head and arms, resembling the scorpion's tail stretched in a threat posture forwards over its body.The pose can also be executed in a variant with straight arms.Whether resting on forearms (Pincha Mayurasana) or with arms in handstand, the asana can be worked towards with the use of a chair to support the feet.\nLight on Yoga distinguishes Vrischikasana I (forearm balance, feet on head, plates 536 and 537) and Vrischikasana II (handstand, feet on head, plate 538), describing the second as an \"extremely difficult\" balance. The placing of the feet on the head is stated to indicate an attempt to subjugate the ego with its \"deadly\" scorpionlike emotions.\nIn 2022, the Indian yoga teacher Yash Moradiya held Vrischikasana for 29 minutes and 4 seconds, as measured by Guinness World Records in Dubai.",
      "url": "https://en.wikipedia.org/wiki/Vrischikasana",
      "benefits": "• Arrests the physical aging process\n• Improves the blood flow to the brain and pituitary gland\n• Revitalizes all body systems\n• Improves circulation in the lower limbs and abdomen\n• Tones the reproductive organs\n• Stretches and loosens the back\n• Tones nerves and spine\n• Strengthens the arms\n• Develops a Sense of Balance"
    },
    {
      "passioID": "1003709",
      "name": "Yoganidrasana",
      "sanskrit": "योगनिद्रासन",
      "english": "Yogic sleep",
      "type": "Reclining",
      "description": "In Yoganidrasana, the back is on the ground, the feet are crossed behind the head, and the arms are wrapped around the legs and body, the hands clasped behind the lower back.The effect is of a strong forward bend; B. K. S. Iyengar rates its difficulty as 18 out of 60.The practice is said to warm the body rapidly.\nIn Ashtanga Vinyasa Yoga, the pose is in the intermediate series.",
      "url": "https://en.wikipedia.org/wiki/Yoganidrasana",
      "benefits": "• Yoganidrasana relives in stress, fatigue & relaxes your mind.\n• Sleeping Yogi Yoga pose stretches and strengthens your hamstrings, hip flexors, calves and spinal muscles.\n• Best hip opener posture. Yoganidrasana gives you the benefits of both meditation and half sleep."
    }
]
